// Тип данных: массив

// let array = [1,2,3,4,5]
// console.log(array[0]); -> по индексам
// одинаковый как 1
// let array = new Array(1,2,3,4,5)
// console.log(array);

// ====================================================== зменение индекса ======================================================
// let array = [1,2,3,4,5]
// array [0] =  10
// console.log(array[0]) -> [10,2,3,4,5]

// ------ добавить несушествушего индекса -----
// всего 5 индекса но указывам 10 то добавит до 10го индекса 4 пустых элементов
// array [10] =  10  -> [1,2,3,4,5,6 <empty> 10]

// ------- определить новую длину массива ----
// --- прибавление ---
// array.length = 20
// console.log(array); -> 20

// --- уменьшать ---
// let array = [1,2,3,4,5]
// array.length = 3
// console.log(array); -> [1,2,3]


// ============================================================== Цикл ==================================================================
// ----- 1.Вариант ----- 
let array = [10,20,30,40,50]
for (let i = 0; i < array.length; i++) {
    // array[i] = array[i] * 2
    console.log(array[i]);
}
// console.log(array);

// ------ обратный порядок элементов массива ----
// (let i = array.length -1 ; i >= 0; i--)




// ----- 2.Вариант (нельзя зделать -  по шагам)-----
let array1 = [10,20,30,40,50]
for (let elem of array1) {
    // elem = elem * 2
    // console.log(elem);
    console.log(elem);
}

// let new_array = []
// for (let elem of array) {
//     elem = elem * 2
//     new_array.push(elem);
// }
// console.log(new_array);

// ------ обратный порядок элементов массива (reverse - переворачивает) ----
// (let elem of array.reverse())

// ============================================================== Practice ==================================================================
// Task 1
// Используя цикл, выведите каждый элемент массива, чей тип равен строковому

let array2 = [1, 'два', 4, true, 56, false, 'один', 'телевизор'];

for (let elem of array2) {
    if (typeof elem === 'string') {
      console.log(elem);
    }
}

// for (let i = 0; i < array2.length; i++) {
//   if (typeof array2[i] === 'string') {
//     console.log(array2[i]);
//   }
// }








