// При закрытие браузера или перезагрузки страницы сессия закрывается и все данные удаляется, тем в временем как в local Storage 
// данные хронятся вечно пока сам в ручную не удалим

// Local storage + Session storage vожно увидеть в Application 

// Обекты и строковые значениеб свойства хранится

// Память
// localStorage и sessionStorage - это два механизма хранения данных веб-страницы на стороне клиента (в браузере), 
// которые предоставляются веб-браузерами в рамках веб-хранилища HTML5.

// localStorage:
// Данные сохраняются даже после закрытия браузера.
// Доступен для всего домена.
// Может использоваться для долгосрочного хранения.

// sessionStorage:
// Данные сохраняются только в течение сеанса браузера.
// Доступен только для текущей вкладки.
// Используется для временного хранения данных в течение сеанса.
