// https://docs.google.com/document/d/1jGnYASY8krVegDiJ1qj5nR8KYQ3_GVAzih2ZM-0GBKI/edit

// 1. Задание
// user_form_app -> script.js -> в самом низу



// 2. Задание
// Верстка
// Задан макет сайта: 
// https://www.figma.com/file/eAPQB6wHJZtTxCOzgeAsdw/Templates-%2310.-short?type=design&node-id=1-2&mode=design&t=lw7wlHE6xVSMfJDL-0

// Необходимо сверстать макет, соблюдая ряд требований: 
// Стилизация должна полностью соответствовать макету. 
// Работа будет считаться качественной, если в течении 
// 5-10 секунд не найдутся отличия результата от макета. 
// Шрифты и размер шрифтов должны также соответствовать макету.
// На разметке должно быть не более 1 заголовка первого уровня, 
// размер всех UI элементов (например, кнопок) должны быть 
// реализованы используя padding, У всех img в обязательном порядке 
// должна быть указана высота, ширина и alt.
// В работе необходимо также продемонстрировать работу с комбинированными 
// селекторами (+, >, ~, ‘ ’ и тд) в целях упрощения объявлений классов.

